FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/instance/instance_xdmac.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2014, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAMV71_XDMAC_INSTANCE_
#define _SAMV71_XDMAC_INSTANCE_

/* ========== Register definition for XDMAC peripheral ========== */
#if ( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    #define REG_XDMAC_GTYPE        ( 0x40078000U )                      /**< \brief (XDMAC) Global Type Register */
    #define REG_XDMAC_GCFG         ( 0x40078004U )                      /**< \brief (XDMAC) Global Configuration Register */
    #define REG_XDMAC_GWAC         ( 0x40078008U )                      /**< \brief (XDMAC) Global Weighted Arbiter Configuration Register */
    #define REG_XDMAC_GIE          ( 0x4007800CU )                      /**< \brief (XDMAC) Global Interrupt Enable Register */
    #define REG_XDMAC_GID          ( 0x40078010U )                      /**< \brief (XDMAC) Global Interrupt Disable Register */
    #define REG_XDMAC_GIM          ( 0x40078014U )                      /**< \brief (XDMAC) Global Interrupt Mask Register */
    #define REG_XDMAC_GIS          ( 0x40078018U )                      /**< \brief (XDMAC) Global Interrupt Status Register */
    #define REG_XDMAC_GE           ( 0x4007801CU )                      /**< \brief (XDMAC) Global Channel Enable Register */
    #define REG_XDMAC_GD           ( 0x40078020U )                      /**< \brief (XDMAC) Global Channel Disable Register */
    #define REG_XDMAC_GS           ( 0x40078024U )                      /**< \brief (XDMAC) Global Channel Status Register */
    #define REG_XDMAC_GRS          ( 0x40078028U )                      /**< \brief (XDMAC) Global Channel Read Suspend Register */
    #define REG_XDMAC_GWS          ( 0x4007802CU )                      /**< \brief (XDMAC) Global Channel Write Suspend Register */
    #define REG_XDMAC_GRWS         ( 0x40078030U )                      /**< \brief (XDMAC) Global Channel Read Write Suspend Register */
    #define REG_XDMAC_GRWR         ( 0x40078034U )                      /**< \brief (XDMAC) Global Channel Read Write Resume Register */
    #define REG_XDMAC_GSWR         ( 0x40078038U )                      /**< \brief (XDMAC) Global Channel Software Request Register */
    #define REG_XDMAC_GSWS         ( 0x4007803CU )                      /**< \brief (XDMAC) Global Channel Software Request Status Register */
    #define REG_XDMAC_GSWF         ( 0x40078040U )                      /**< \brief (XDMAC) Global Channel Software Flush Request Register */
    #define REG_XDMAC_CIE0         ( 0x40078050U )                      /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 0) */
    #define REG_XDMAC_CID0         ( 0x40078054U )                      /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 0) */
    #define REG_XDMAC_CIM0         ( 0x40078058U )                      /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 0) */
    #define REG_XDMAC_CIS0         ( 0x4007805CU )                      /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 0) */
    #define REG_XDMAC_CSA0         ( 0x40078060U )                      /**< \brief (XDMAC) Channel Source Address Register (chid = 0) */
    #define REG_XDMAC_CDA0         ( 0x40078064U )                      /**< \brief (XDMAC) Channel Destination Address Register (chid = 0) */
    #define REG_XDMAC_CNDA0        ( 0x40078068U )                      /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 0) */
    #define REG_XDMAC_CNDC0        ( 0x4007806CU )                      /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 0) */
    #define REG_XDMAC_CUBC0        ( 0x40078070U )                      /**< \brief (XDMAC) Channel Microblock Control Register (chid = 0) */
    #define REG_XDMAC_CBC0         ( 0x40078074U )                      /**< \brief (XDMAC) Channel Block Control Register (chid = 0) */
    #define REG_XDMAC_CC0          ( 0x40078078U )                      /**< \brief (XDMAC) Channel Configuration Register (chid = 0) */
    #define REG_XDMAC_CDS_MSP0     ( 0x4007807CU )                      /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) */
    #define REG_XDMAC_CSUS0        ( 0x40078080U )                      /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 0) */
    #define REG_XDMAC_CDUS0        ( 0x40078084U )                      /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 0) */
    #define REG_XDMAC_CIE1         ( 0x40078090U )                      /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 1) */
    #define REG_XDMAC_CID1         ( 0x40078094U )                      /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 1) */
    #define REG_XDMAC_CIM1         ( 0x40078098U )                      /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 1) */
    #define REG_XDMAC_CIS1         ( 0x4007809CU )                      /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 1) */
    #define REG_XDMAC_CSA1         ( 0x400780A0U )                      /**< \brief (XDMAC) Channel Source Address Register (chid = 1) */
    #define REG_XDMAC_CDA1         ( 0x400780A4U )                      /**< \brief (XDMAC) Channel Destination Address Register (chid = 1) */
    #define REG_XDMAC_CNDA1        ( 0x400780A8U )                      /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 1) */
    #define REG_XDMAC_CNDC1        ( 0x400780ACU )                      /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 1) */
    #define REG_XDMAC_CUBC1        ( 0x400780B0U )                      /**< \brief (XDMAC) Channel Microblock Control Register (chid = 1) */
    #define REG_XDMAC_CBC1         ( 0x400780B4U )                      /**< \brief (XDMAC) Channel Block Control Register (chid = 1) */
    #define REG_XDMAC_CC1          ( 0x400780B8U )                      /**< \brief (XDMAC) Channel Configuration Register (chid = 1) */
    #define REG_XDMAC_CDS_MSP1     ( 0x400780BCU )                      /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 1) */
    #define REG_XDMAC_CSUS1        ( 0x400780C0U )                      /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 1) */
    #define REG_XDMAC_CDUS1        ( 0x400780C4U )                      /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 1) */
    #define REG_XDMAC_CIE2         ( 0x400780D0U )                      /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 2) */
    #define REG_XDMAC_CID2         ( 0x400780D4U )                      /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 2) */
    #define REG_XDMAC_CIM2         ( 0x400780D8U )                      /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 2) */
    #define REG_XDMAC_CIS2         ( 0x400780DCU )                      /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 2) */
    #define REG_XDMAC_CSA2         ( 0x400780E0U )                      /**< \brief (XDMAC) Channel Source Address Register (chid = 2) */
    #define REG_XDMAC_CDA2         ( 0x400780E4U )                      /**< \brief (XDMAC) Channel Destination Address Register (chid = 2) */
    #define REG_XDMAC_CNDA2        ( 0x400780E8U )                      /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 2) */
    #define REG_XDMAC_CNDC2        ( 0x400780ECU )                      /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 2) */
    #define REG_XDMAC_CUBC2        ( 0x400780F0U )                      /**< \brief (XDMAC) Channel Microblock Control Register (chid = 2) */
    #define REG_XDMAC_CBC2         ( 0x400780F4U )                      /**< \brief (XDMAC) Channel Block Control Register (chid = 2) */
    #define REG_XDMAC_CC2          ( 0x400780F8U )                      /**< \brief (XDMAC) Channel Configuration Register (chid = 2) */
    #define REG_XDMAC_CDS_MSP2     ( 0x400780FCU )                      /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 2) */
    #define REG_XDMAC_CSUS2        ( 0x40078100U )                      /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 2) */
    #define REG_XDMAC_CDUS2        ( 0x40078104U )                      /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 2) */
    #define REG_XDMAC_CIE3         ( 0x40078110U )                      /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 3) */
    #define REG_XDMAC_CID3         ( 0x40078114U )                      /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 3) */
    #define REG_XDMAC_CIM3         ( 0x40078118U )                      /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 3) */
    #define REG_XDMAC_CIS3         ( 0x4007811CU )                      /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 3) */
    #define REG_XDMAC_CSA3         ( 0x40078120U )                      /**< \brief (XDMAC) Channel Source Address Register (chid = 3) */
    #define REG_XDMAC_CDA3         ( 0x40078124U )                      /**< \brief (XDMAC) Channel Destination Address Register (chid = 3) */
    #define REG_XDMAC_CNDA3        ( 0x40078128U )                      /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 3) */
    #define REG_XDMAC_CNDC3        ( 0x4007812CU )                      /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 3) */
    #define REG_XDMAC_CUBC3        ( 0x40078130U )                      /**< \brief (XDMAC) Channel Microblock Control Register (chid = 3) */
    #define REG_XDMAC_CBC3         ( 0x40078134U )                      /**< \brief (XDMAC) Channel Block Control Register (chid = 3) */
    #define REG_XDMAC_CC3          ( 0x40078138U )                      /**< \brief (XDMAC) Channel Configuration Register (chid = 3) */
    #define REG_XDMAC_CDS_MSP3     ( 0x4007813CU )                      /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 3) */
    #define REG_XDMAC_CSUS3        ( 0x40078140U )                      /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 3) */
    #define REG_XDMAC_CDUS3        ( 0x40078144U )                      /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 3) */
    #define REG_XDMAC_CIE4         ( 0x40078150U )                      /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 4) */
    #define REG_XDMAC_CID4         ( 0x40078154U )                      /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 4) */
    #define REG_XDMAC_CIM4         ( 0x40078158U )                      /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 4) */
    #define REG_XDMAC_CIS4         ( 0x4007815CU )                      /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 4) */
    #define REG_XDMAC_CSA4         ( 0x40078160U )                      /**< \brief (XDMAC) Channel Source Address Register (chid = 4) */
    #define REG_XDMAC_CDA4         ( 0x40078164U )                      /**< \brief (XDMAC) Channel Destination Address Register (chid = 4) */
    #define REG_XDMAC_CNDA4        ( 0x40078168U )                      /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 4) */
    #define REG_XDMAC_CNDC4        ( 0x4007816CU )                      /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 4) */
    #define REG_XDMAC_CUBC4        ( 0x40078170U )                      /**< \brief (XDMAC) Channel Microblock Control Register (chid = 4) */
    #define REG_XDMAC_CBC4         ( 0x40078174U )                      /**< \brief (XDMAC) Channel Block Control Register (chid = 4) */
    #define REG_XDMAC_CC4          ( 0x40078178U )                      /**< \brief (XDMAC) Channel Configuration Register (chid = 4) */
    #define REG_XDMAC_CDS_MSP4     ( 0x4007817CU )                      /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 4) */
    #define REG_XDMAC_CSUS4        ( 0x40078180U )                      /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 4) */
    #define REG_XDMAC_CDUS4        ( 0x40078184U )                      /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 4) */
    #define REG_XDMAC_CIE5         ( 0x40078190U )                      /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 5) */
    #define REG_XDMAC_CID5         ( 0x40078194U )                      /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 5) */
    #define REG_XDMAC_CIM5         ( 0x40078198U )                      /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 5) */
    #define REG_XDMAC_CIS5         ( 0x4007819CU )                      /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 5) */
    #define REG_XDMAC_CSA5         ( 0x400781A0U )                      /**< \brief (XDMAC) Channel Source Address Register (chid = 5) */
    #define REG_XDMAC_CDA5         ( 0x400781A4U )                      /**< \brief (XDMAC) Channel Destination Address Register (chid = 5) */
    #define REG_XDMAC_CNDA5        ( 0x400781A8U )                      /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 5) */
    #define REG_XDMAC_CNDC5        ( 0x400781ACU )                      /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 5) */
    #define REG_XDMAC_CUBC5        ( 0x400781B0U )                      /**< \brief (XDMAC) Channel Microblock Control Register (chid = 5) */
    #define REG_XDMAC_CBC5         ( 0x400781B4U )                      /**< \brief (XDMAC) Channel Block Control Register (chid = 5) */
    #define REG_XDMAC_CC5          ( 0x400781B8U )                      /**< \brief (XDMAC) Channel Configuration Register (chid = 5) */
    #define REG_XDMAC_CDS_MSP5     ( 0x400781BCU )                      /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 5) */
    #define REG_XDMAC_CSUS5        ( 0x400781C0U )                      /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 5) */
    #define REG_XDMAC_CDUS5        ( 0x400781C4U )                      /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 5) */
    #define REG_XDMAC_CIE6         ( 0x400781D0U )                      /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 6) */
    #define REG_XDMAC_CID6         ( 0x400781D4U )                      /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 6) */
    #define REG_XDMAC_CIM6         ( 0x400781D8U )                      /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 6) */
    #define REG_XDMAC_CIS6         ( 0x400781DCU )                      /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 6) */
    #define REG_XDMAC_CSA6         ( 0x400781E0U )                      /**< \brief (XDMAC) Channel Source Address Register (chid = 6) */
    #define REG_XDMAC_CDA6         ( 0x400781E4U )                      /**< \brief (XDMAC) Channel Destination Address Register (chid = 6) */
    #define REG_XDMAC_CNDA6        ( 0x400781E8U )                      /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 6) */
    #define REG_XDMAC_CNDC6        ( 0x400781ECU )                      /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 6) */
    #define REG_XDMAC_CUBC6        ( 0x400781F0U )                      /**< \brief (XDMAC) Channel Microblock Control Register (chid = 6) */
    #define REG_XDMAC_CBC6         ( 0x400781F4U )                      /**< \brief (XDMAC) Channel Block Control Register (chid = 6) */
    #define REG_XDMAC_CC6          ( 0x400781F8U )                      /**< \brief (XDMAC) Channel Configuration Register (chid = 6) */
    #define REG_XDMAC_CDS_MSP6     ( 0x400781FCU )                      /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 6) */
    #define REG_XDMAC_CSUS6        ( 0x40078200U )                      /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 6) */
    #define REG_XDMAC_CDUS6        ( 0x40078204U )                      /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 6) */
    #define REG_XDMAC_CIE7         ( 0x40078210U )                      /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 7) */
    #define REG_XDMAC_CID7         ( 0x40078214U )                      /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 7) */
    #define REG_XDMAC_CIM7         ( 0x40078218U )                      /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 7) */
    #define REG_XDMAC_CIS7         ( 0x4007821CU )                      /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 7) */
    #define REG_XDMAC_CSA7         ( 0x40078220U )                      /**< \brief (XDMAC) Channel Source Address Register (chid = 7) */
    #define REG_XDMAC_CDA7         ( 0x40078224U )                      /**< \brief (XDMAC) Channel Destination Address Register (chid = 7) */
    #define REG_XDMAC_CNDA7        ( 0x40078228U )                      /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 7) */
    #define REG_XDMAC_CNDC7        ( 0x4007822CU )                      /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 7) */
    #define REG_XDMAC_CUBC7        ( 0x40078230U )                      /**< \brief (XDMAC) Channel Microblock Control Register (chid = 7) */
    #define REG_XDMAC_CBC7         ( 0x40078234U )                      /**< \brief (XDMAC) Channel Block Control Register (chid = 7) */
    #define REG_XDMAC_CC7          ( 0x40078238U )                      /**< \brief (XDMAC) Channel Configuration Register (chid = 7) */
    #define REG_XDMAC_CDS_MSP7     ( 0x4007823CU )                      /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 7) */
    #define REG_XDMAC_CSUS7        ( 0x40078240U )                      /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 7) */
    #define REG_XDMAC_CDUS7        ( 0x40078244U )                      /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 7) */
    #define REG_XDMAC_CIE8         ( 0x40078250U )                      /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 8) */
    #define REG_XDMAC_CID8         ( 0x40078254U )                      /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 8) */
    #define REG_XDMAC_CIM8         ( 0x40078258U )                      /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 8) */
    #define REG_XDMAC_CIS8         ( 0x4007825CU )                      /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 8) */
    #define REG_XDMAC_CSA8         ( 0x40078260U )                      /**< \brief (XDMAC) Channel Source Address Register (chid = 8) */
    #define REG_XDMAC_CDA8         ( 0x40078264U )                      /**< \brief (XDMAC) Channel Destination Address Register (chid = 8) */
    #define REG_XDMAC_CNDA8        ( 0x40078268U )                      /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 8) */
    #define REG_XDMAC_CNDC8        ( 0x4007826CU )                      /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 8) */
    #define REG_XDMAC_CUBC8        ( 0x40078270U )                      /**< \brief (XDMAC) Channel Microblock Control Register (chid = 8) */
    #define REG_XDMAC_CBC8         ( 0x40078274U )                      /**< \brief (XDMAC) Channel Block Control Register (chid = 8) */
    #define REG_XDMAC_CC8          ( 0x40078278U )                      /**< \brief (XDMAC) Channel Configuration Register (chid = 8) */
    #define REG_XDMAC_CDS_MSP8     ( 0x4007827CU )                      /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 8) */
    #define REG_XDMAC_CSUS8        ( 0x40078280U )                      /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 8) */
    #define REG_XDMAC_CDUS8        ( 0x40078284U )                      /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 8) */
    #define REG_XDMAC_CIE9         ( 0x40078290U )                      /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 9) */
    #define REG_XDMAC_CID9         ( 0x40078294U )                      /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 9) */
    #define REG_XDMAC_CIM9         ( 0x40078298U )                      /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 9) */
    #define REG_XDMAC_CIS9         ( 0x4007829CU )                      /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 9) */
    #define REG_XDMAC_CSA9         ( 0x400782A0U )                      /**< \brief (XDMAC) Channel Source Address Register (chid = 9) */
    #define REG_XDMAC_CDA9         ( 0x400782A4U )                      /**< \brief (XDMAC) Channel Destination Address Register (chid = 9) */
    #define REG_XDMAC_CNDA9        ( 0x400782A8U )                      /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 9) */
    #define REG_XDMAC_CNDC9        ( 0x400782ACU )                      /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 9) */
    #define REG_XDMAC_CUBC9        ( 0x400782B0U )                      /**< \brief (XDMAC) Channel Microblock Control Register (chid = 9) */
    #define REG_XDMAC_CBC9         ( 0x400782B4U )                      /**< \brief (XDMAC) Channel Block Control Register (chid = 9) */
