FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/instance/instance_xdmac.h
    #define REG_XDMAC_CC21         ( 0x400785B8U )                      /**< \brief (XDMAC) Channel Configuration Register (chid = 21) */
    #define REG_XDMAC_CDS_MSP21    ( 0x400785BCU )                      /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 21) */
    #define REG_XDMAC_CSUS21       ( 0x400785C0U )                      /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 21) */
    #define REG_XDMAC_CDUS21       ( 0x400785C4U )                      /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 21) */
    #define REG_XDMAC_CIE22        ( 0x400785D0U )                      /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 22) */
    #define REG_XDMAC_CID22        ( 0x400785D4U )                      /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 22) */
    #define REG_XDMAC_CIM22        ( 0x400785D8U )                      /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 22) */
    #define REG_XDMAC_CIS22        ( 0x400785DCU )                      /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 22) */
    #define REG_XDMAC_CSA22        ( 0x400785E0U )                      /**< \brief (XDMAC) Channel Source Address Register (chid = 22) */
    #define REG_XDMAC_CDA22        ( 0x400785E4U )                      /**< \brief (XDMAC) Channel Destination Address Register (chid = 22) */
    #define REG_XDMAC_CNDA22       ( 0x400785E8U )                      /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 22) */
    #define REG_XDMAC_CNDC22       ( 0x400785ECU )                      /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 22) */
    #define REG_XDMAC_CUBC22       ( 0x400785F0U )                      /**< \brief (XDMAC) Channel Microblock Control Register (chid = 22) */
    #define REG_XDMAC_CBC22        ( 0x400785F4U )                      /**< \brief (XDMAC) Channel Block Control Register (chid = 22) */
    #define REG_XDMAC_CC22         ( 0x400785F8U )                      /**< \brief (XDMAC) Channel Configuration Register (chid = 22) */
    #define REG_XDMAC_CDS_MSP22    ( 0x400785FCU )                      /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 22) */
    #define REG_XDMAC_CSUS22       ( 0x40078600U )                      /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 22) */
    #define REG_XDMAC_CDUS22       ( 0x40078604U )                      /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 22) */
    #define REG_XDMAC_CIE23        ( 0x40078610U )                      /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 23) */
    #define REG_XDMAC_CID23        ( 0x40078614U )                      /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 23) */
    #define REG_XDMAC_CIM23        ( 0x40078618U )                      /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 23) */
    #define REG_XDMAC_CIS23        ( 0x4007861CU )                      /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 23) */
    #define REG_XDMAC_CSA23        ( 0x40078620U )                      /**< \brief (XDMAC) Channel Source Address Register (chid = 23) */
    #define REG_XDMAC_CDA23        ( 0x40078624U )                      /**< \brief (XDMAC) Channel Destination Address Register (chid = 23) */
    #define REG_XDMAC_CNDA23       ( 0x40078628U )                      /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 23) */
    #define REG_XDMAC_CNDC23       ( 0x4007862CU )                      /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 23) */
    #define REG_XDMAC_CUBC23       ( 0x40078630U )                      /**< \brief (XDMAC) Channel Microblock Control Register (chid = 23) */
    #define REG_XDMAC_CBC23        ( 0x40078634U )                      /**< \brief (XDMAC) Channel Block Control Register (chid = 23) */
    #define REG_XDMAC_CC23         ( 0x40078638U )                      /**< \brief (XDMAC) Channel Configuration Register (chid = 23) */
    #define REG_XDMAC_CDS_MSP23    ( 0x4007863CU )                      /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 23) */
    #define REG_XDMAC_CSUS23       ( 0x40078640U )                      /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 23) */
    #define REG_XDMAC_CDUS23       ( 0x40078644U )                      /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 23) */
#else  /* if ( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) ) */
    #define REG_XDMAC_GTYPE        ( *( __IO uint32_t * ) 0x40078000U ) /**< \brief (XDMAC) Global Type Register */
    #define REG_XDMAC_GCFG         ( *( __I uint32_t * ) 0x40078004U )  /**< \brief (XDMAC) Global Configuration Register */
    #define REG_XDMAC_GWAC         ( *( __IO uint32_t * ) 0x40078008U ) /**< \brief (XDMAC) Global Weighted Arbiter Configuration Register */
    #define REG_XDMAC_GIE          ( *( __O uint32_t * ) 0x4007800CU )  /**< \brief (XDMAC) Global Interrupt Enable Register */
    #define REG_XDMAC_GID          ( *( __O uint32_t * ) 0x40078010U )  /**< \brief (XDMAC) Global Interrupt Disable Register */
    #define REG_XDMAC_GIM          ( *( __I uint32_t * ) 0x40078014U )  /**< \brief (XDMAC) Global Interrupt Mask Register */
    #define REG_XDMAC_GIS          ( *( __I uint32_t * ) 0x40078018U )  /**< \brief (XDMAC) Global Interrupt Status Register */
    #define REG_XDMAC_GE           ( *( __O uint32_t * ) 0x4007801CU )  /**< \brief (XDMAC) Global Channel Enable Register */
    #define REG_XDMAC_GD           ( *( __O uint32_t * ) 0x40078020U )  /**< \brief (XDMAC) Global Channel Disable Register */
    #define REG_XDMAC_GS           ( *( __I uint32_t * ) 0x40078024U )  /**< \brief (XDMAC) Global Channel Status Register */
    #define REG_XDMAC_GRS          ( *( __IO uint32_t * ) 0x40078028U ) /**< \brief (XDMAC) Global Channel Read Suspend Register */
    #define REG_XDMAC_GWS          ( *( __IO uint32_t * ) 0x4007802CU ) /**< \brief (XDMAC) Global Channel Write Suspend Register */
    #define REG_XDMAC_GRWS         ( *( __O uint32_t * ) 0x40078030U )  /**< \brief (XDMAC) Global Channel Read Write Suspend Register */
    #define REG_XDMAC_GRWR         ( *( __O uint32_t * ) 0x40078034U )  /**< \brief (XDMAC) Global Channel Read Write Resume Register */
    #define REG_XDMAC_GSWR         ( *( __O uint32_t * ) 0x40078038U )  /**< \brief (XDMAC) Global Channel Software Request Register */
    #define REG_XDMAC_GSWS         ( *( __I uint32_t * ) 0x4007803CU )  /**< \brief (XDMAC) Global Channel Software Request Status Register */
    #define REG_XDMAC_GSWF         ( *( __O uint32_t * ) 0x40078040U )  /**< \brief (XDMAC) Global Channel Software Flush Request Register */
    #define REG_XDMAC_CIE0         ( *( __O uint32_t * ) 0x40078050U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 0) */
    #define REG_XDMAC_CID0         ( *( __O uint32_t * ) 0x40078054U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 0) */
    #define REG_XDMAC_CIM0         ( *( __O uint32_t * ) 0x40078058U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 0) */
    #define REG_XDMAC_CIS0         ( *( __I uint32_t * ) 0x4007805CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 0) */
    #define REG_XDMAC_CSA0         ( *( __IO uint32_t * ) 0x40078060U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 0) */
    #define REG_XDMAC_CDA0         ( *( __IO uint32_t * ) 0x40078064U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 0) */
    #define REG_XDMAC_CNDA0        ( *( __IO uint32_t * ) 0x40078068U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 0) */
    #define REG_XDMAC_CNDC0        ( *( __IO uint32_t * ) 0x4007806CU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 0) */
    #define REG_XDMAC_CUBC0        ( *( __IO uint32_t * ) 0x40078070U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 0) */
    #define REG_XDMAC_CBC0         ( *( __IO uint32_t * ) 0x40078074U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 0) */
    #define REG_XDMAC_CC0          ( *( __IO uint32_t * ) 0x40078078U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 0) */
    #define REG_XDMAC_CDS_MSP0     ( *( __IO uint32_t * ) 0x4007807CU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) */
    #define REG_XDMAC_CSUS0        ( *( __IO uint32_t * ) 0x40078080U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 0) */
    #define REG_XDMAC_CDUS0        ( *( __IO uint32_t * ) 0x40078084U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 0) */
    #define REG_XDMAC_CIE1         ( *( __O uint32_t * ) 0x40078090U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 1) */
    #define REG_XDMAC_CID1         ( *( __O uint32_t * ) 0x40078094U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 1) */
    #define REG_XDMAC_CIM1         ( *( __O uint32_t * ) 0x40078098U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 1) */
    #define REG_XDMAC_CIS1         ( *( __I uint32_t * ) 0x4007809CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 1) */
    #define REG_XDMAC_CSA1         ( *( __IO uint32_t * ) 0x400780A0U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 1) */
    #define REG_XDMAC_CDA1         ( *( __IO uint32_t * ) 0x400780A4U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 1) */
    #define REG_XDMAC_CNDA1        ( *( __IO uint32_t * ) 0x400780A8U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 1) */
    #define REG_XDMAC_CNDC1        ( *( __IO uint32_t * ) 0x400780ACU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 1) */
    #define REG_XDMAC_CUBC1        ( *( __IO uint32_t * ) 0x400780B0U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 1) */
    #define REG_XDMAC_CBC1         ( *( __IO uint32_t * ) 0x400780B4U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 1) */
    #define REG_XDMAC_CC1          ( *( __IO uint32_t * ) 0x400780B8U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 1) */
    #define REG_XDMAC_CDS_MSP1     ( *( __IO uint32_t * ) 0x400780BCU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 1) */
    #define REG_XDMAC_CSUS1        ( *( __IO uint32_t * ) 0x400780C0U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 1) */
    #define REG_XDMAC_CDUS1        ( *( __IO uint32_t * ) 0x400780C4U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 1) */
    #define REG_XDMAC_CIE2         ( *( __O uint32_t * ) 0x400780D0U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 2) */
    #define REG_XDMAC_CID2         ( *( __O uint32_t * ) 0x400780D4U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 2) */
    #define REG_XDMAC_CIM2         ( *( __O uint32_t * ) 0x400780D8U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 2) */
    #define REG_XDMAC_CIS2         ( *( __I uint32_t * ) 0x400780DCU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 2) */
    #define REG_XDMAC_CSA2         ( *( __IO uint32_t * ) 0x400780E0U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 2) */
    #define REG_XDMAC_CDA2         ( *( __IO uint32_t * ) 0x400780E4U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 2) */
    #define REG_XDMAC_CNDA2        ( *( __IO uint32_t * ) 0x400780E8U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 2) */
    #define REG_XDMAC_CNDC2        ( *( __IO uint32_t * ) 0x400780ECU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 2) */
    #define REG_XDMAC_CUBC2        ( *( __IO uint32_t * ) 0x400780F0U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 2) */
    #define REG_XDMAC_CBC2         ( *( __IO uint32_t * ) 0x400780F4U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 2) */
    #define REG_XDMAC_CC2          ( *( __IO uint32_t * ) 0x400780F8U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 2) */
    #define REG_XDMAC_CDS_MSP2     ( *( __IO uint32_t * ) 0x400780FCU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 2) */
    #define REG_XDMAC_CSUS2        ( *( __IO uint32_t * ) 0x40078100U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 2) */
    #define REG_XDMAC_CDUS2        ( *( __IO uint32_t * ) 0x40078104U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 2) */
    #define REG_XDMAC_CIE3         ( *( __O uint32_t * ) 0x40078110U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 3) */
    #define REG_XDMAC_CID3         ( *( __O uint32_t * ) 0x40078114U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 3) */
    #define REG_XDMAC_CIM3         ( *( __O uint32_t * ) 0x40078118U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 3) */
    #define REG_XDMAC_CIS3         ( *( __I uint32_t * ) 0x4007811CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 3) */
    #define REG_XDMAC_CSA3         ( *( __IO uint32_t * ) 0x40078120U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 3) */
    #define REG_XDMAC_CDA3         ( *( __IO uint32_t * ) 0x40078124U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 3) */
    #define REG_XDMAC_CNDA3        ( *( __IO uint32_t * ) 0x40078128U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 3) */
    #define REG_XDMAC_CNDC3        ( *( __IO uint32_t * ) 0x4007812CU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 3) */
    #define REG_XDMAC_CUBC3        ( *( __IO uint32_t * ) 0x40078130U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 3) */
    #define REG_XDMAC_CBC3         ( *( __IO uint32_t * ) 0x40078134U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 3) */
    #define REG_XDMAC_CC3          ( *( __IO uint32_t * ) 0x40078138U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 3) */
    #define REG_XDMAC_CDS_MSP3     ( *( __IO uint32_t * ) 0x4007813CU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 3) */
    #define REG_XDMAC_CSUS3        ( *( __IO uint32_t * ) 0x40078140U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 3) */
    #define REG_XDMAC_CDUS3        ( *( __IO uint32_t * ) 0x40078144U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 3) */
    #define REG_XDMAC_CIE4         ( *( __O uint32_t * ) 0x40078150U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 4) */
    #define REG_XDMAC_CID4         ( *( __O uint32_t * ) 0x40078154U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 4) */
    #define REG_XDMAC_CIM4         ( *( __O uint32_t * ) 0x40078158U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 4) */
    #define REG_XDMAC_CIS4         ( *( __I uint32_t * ) 0x4007815CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 4) */
    #define REG_XDMAC_CSA4         ( *( __IO uint32_t * ) 0x40078160U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 4) */
    #define REG_XDMAC_CDA4         ( *( __IO uint32_t * ) 0x40078164U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 4) */
    #define REG_XDMAC_CNDA4        ( *( __IO uint32_t * ) 0x40078168U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 4) */
    #define REG_XDMAC_CNDC4        ( *( __IO uint32_t * ) 0x4007816CU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 4) */
    #define REG_XDMAC_CUBC4        ( *( __IO uint32_t * ) 0x40078170U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 4) */
    #define REG_XDMAC_CBC4         ( *( __IO uint32_t * ) 0x40078174U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 4) */
    #define REG_XDMAC_CC4          ( *( __IO uint32_t * ) 0x40078178U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 4) */
    #define REG_XDMAC_CDS_MSP4     ( *( __IO uint32_t * ) 0x4007817CU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 4) */
    #define REG_XDMAC_CSUS4        ( *( __IO uint32_t * ) 0x40078180U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 4) */
    #define REG_XDMAC_CDUS4        ( *( __IO uint32_t * ) 0x40078184U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 4) */
    #define REG_XDMAC_CIE5         ( *( __O uint32_t * ) 0x40078190U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 5) */
    #define REG_XDMAC_CID5         ( *( __O uint32_t * ) 0x40078194U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 5) */
    #define REG_XDMAC_CIM5         ( *( __O uint32_t * ) 0x40078198U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 5) */
    #define REG_XDMAC_CIS5         ( *( __I uint32_t * ) 0x4007819CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 5) */
    #define REG_XDMAC_CSA5         ( *( __IO uint32_t * ) 0x400781A0U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 5) */
    #define REG_XDMAC_CDA5         ( *( __IO uint32_t * ) 0x400781A4U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 5) */
    #define REG_XDMAC_CNDA5        ( *( __IO uint32_t * ) 0x400781A8U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 5) */
    #define REG_XDMAC_CNDC5        ( *( __IO uint32_t * ) 0x400781ACU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 5) */
    #define REG_XDMAC_CUBC5        ( *( __IO uint32_t * ) 0x400781B0U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 5) */
    #define REG_XDMAC_CBC5         ( *( __IO uint32_t * ) 0x400781B4U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 5) */
    #define REG_XDMAC_CC5          ( *( __IO uint32_t * ) 0x400781B8U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 5) */
    #define REG_XDMAC_CDS_MSP5     ( *( __IO uint32_t * ) 0x400781BCU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 5) */
    #define REG_XDMAC_CSUS5        ( *( __IO uint32_t * ) 0x400781C0U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 5) */
    #define REG_XDMAC_CDUS5        ( *( __IO uint32_t * ) 0x400781C4U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 5) */
    #define REG_XDMAC_CIE6         ( *( __O uint32_t * ) 0x400781D0U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 6) */
    #define REG_XDMAC_CID6         ( *( __O uint32_t * ) 0x400781D4U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 6) */
    #define REG_XDMAC_CIM6         ( *( __O uint32_t * ) 0x400781D8U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 6) */
    #define REG_XDMAC_CIS6         ( *( __I uint32_t * ) 0x400781DCU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 6) */
    #define REG_XDMAC_CSA6         ( *( __IO uint32_t * ) 0x400781E0U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 6) */
    #define REG_XDMAC_CDA6         ( *( __IO uint32_t * ) 0x400781E4U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 6) */
    #define REG_XDMAC_CNDA6        ( *( __IO uint32_t * ) 0x400781E8U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 6) */
    #define REG_XDMAC_CNDC6        ( *( __IO uint32_t * ) 0x400781ECU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 6) */
    #define REG_XDMAC_CUBC6        ( *( __IO uint32_t * ) 0x400781F0U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 6) */
    #define REG_XDMAC_CBC6         ( *( __IO uint32_t * ) 0x400781F4U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 6) */
    #define REG_XDMAC_CC6          ( *( __IO uint32_t * ) 0x400781F8U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 6) */
    #define REG_XDMAC_CDS_MSP6     ( *( __IO uint32_t * ) 0x400781FCU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 6) */
    #define REG_XDMAC_CSUS6        ( *( __IO uint32_t * ) 0x40078200U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 6) */
    #define REG_XDMAC_CDUS6        ( *( __IO uint32_t * ) 0x40078204U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 6) */
    #define REG_XDMAC_CIE7         ( *( __O uint32_t * ) 0x40078210U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 7) */
    #define REG_XDMAC_CID7         ( *( __O uint32_t * ) 0x40078214U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 7) */
    #define REG_XDMAC_CIM7         ( *( __O uint32_t * ) 0x40078218U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 7) */
    #define REG_XDMAC_CIS7         ( *( __I uint32_t * ) 0x4007821CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 7) */
    #define REG_XDMAC_CSA7         ( *( __IO uint32_t * ) 0x40078220U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 7) */
    #define REG_XDMAC_CDA7         ( *( __IO uint32_t * ) 0x40078224U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 7) */
    #define REG_XDMAC_CNDA7        ( *( __IO uint32_t * ) 0x40078228U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 7) */
    #define REG_XDMAC_CNDC7        ( *( __IO uint32_t * ) 0x4007822CU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 7) */
    #define REG_XDMAC_CUBC7        ( *( __IO uint32_t * ) 0x40078230U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 7) */
    #define REG_XDMAC_CBC7         ( *( __IO uint32_t * ) 0x40078234U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 7) */
    #define REG_XDMAC_CC7          ( *( __IO uint32_t * ) 0x40078238U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 7) */
    #define REG_XDMAC_CDS_MSP7     ( *( __IO uint32_t * ) 0x4007823CU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 7) */
    #define REG_XDMAC_CSUS7        ( *( __IO uint32_t * ) 0x40078240U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 7) */
    #define REG_XDMAC_CDUS7        ( *( __IO uint32_t * ) 0x40078244U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 7) */
    #define REG_XDMAC_CIE8         ( *( __O uint32_t * ) 0x40078250U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 8) */
    #define REG_XDMAC_CID8         ( *( __O uint32_t * ) 0x40078254U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 8) */
    #define REG_XDMAC_CIM8         ( *( __O uint32_t * ) 0x40078258U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 8) */
    #define REG_XDMAC_CIS8         ( *( __I uint32_t * ) 0x4007825CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 8) */
    #define REG_XDMAC_CSA8         ( *( __IO uint32_t * ) 0x40078260U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 8) */
    #define REG_XDMAC_CDA8         ( *( __IO uint32_t * ) 0x40078264U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 8) */
    #define REG_XDMAC_CNDA8        ( *( __IO uint32_t * ) 0x40078268U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 8) */
    #define REG_XDMAC_CNDC8        ( *( __IO uint32_t * ) 0x4007826CU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 8) */
    #define REG_XDMAC_CUBC8        ( *( __IO uint32_t * ) 0x40078270U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 8) */
