FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/instance/instance_xdmac.h
    #define REG_XDMAC_CBC8         ( *( __IO uint32_t * ) 0x40078274U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 8) */
    #define REG_XDMAC_CC8          ( *( __IO uint32_t * ) 0x40078278U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 8) */
    #define REG_XDMAC_CDS_MSP8     ( *( __IO uint32_t * ) 0x4007827CU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 8) */
    #define REG_XDMAC_CSUS8        ( *( __IO uint32_t * ) 0x40078280U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 8) */
    #define REG_XDMAC_CDUS8        ( *( __IO uint32_t * ) 0x40078284U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 8) */
    #define REG_XDMAC_CIE9         ( *( __O uint32_t * ) 0x40078290U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 9) */
    #define REG_XDMAC_CID9         ( *( __O uint32_t * ) 0x40078294U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 9) */
    #define REG_XDMAC_CIM9         ( *( __O uint32_t * ) 0x40078298U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 9) */
    #define REG_XDMAC_CIS9         ( *( __I uint32_t * ) 0x4007829CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 9) */
    #define REG_XDMAC_CSA9         ( *( __IO uint32_t * ) 0x400782A0U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 9) */
    #define REG_XDMAC_CDA9         ( *( __IO uint32_t * ) 0x400782A4U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 9) */
    #define REG_XDMAC_CNDA9        ( *( __IO uint32_t * ) 0x400782A8U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 9) */
    #define REG_XDMAC_CNDC9        ( *( __IO uint32_t * ) 0x400782ACU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 9) */
    #define REG_XDMAC_CUBC9        ( *( __IO uint32_t * ) 0x400782B0U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 9) */
    #define REG_XDMAC_CBC9         ( *( __IO uint32_t * ) 0x400782B4U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 9) */
    #define REG_XDMAC_CC9          ( *( __IO uint32_t * ) 0x400782B8U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 9) */
    #define REG_XDMAC_CDS_MSP9     ( *( __IO uint32_t * ) 0x400782BCU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 9) */
    #define REG_XDMAC_CSUS9        ( *( __IO uint32_t * ) 0x400782C0U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 9) */
    #define REG_XDMAC_CDUS9        ( *( __IO uint32_t * ) 0x400782C4U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 9) */
    #define REG_XDMAC_CIE10        ( *( __O uint32_t * ) 0x400782D0U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 10) */
    #define REG_XDMAC_CID10        ( *( __O uint32_t * ) 0x400782D4U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 10) */
    #define REG_XDMAC_CIM10        ( *( __O uint32_t * ) 0x400782D8U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 10) */
    #define REG_XDMAC_CIS10        ( *( __I uint32_t * ) 0x400782DCU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 10) */
    #define REG_XDMAC_CSA10        ( *( __IO uint32_t * ) 0x400782E0U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 10) */
    #define REG_XDMAC_CDA10        ( *( __IO uint32_t * ) 0x400782E4U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 10) */
    #define REG_XDMAC_CNDA10       ( *( __IO uint32_t * ) 0x400782E8U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 10) */
    #define REG_XDMAC_CNDC10       ( *( __IO uint32_t * ) 0x400782ECU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 10) */
    #define REG_XDMAC_CUBC10       ( *( __IO uint32_t * ) 0x400782F0U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 10) */
    #define REG_XDMAC_CBC10        ( *( __IO uint32_t * ) 0x400782F4U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 10) */
    #define REG_XDMAC_CC10         ( *( __IO uint32_t * ) 0x400782F8U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 10) */
    #define REG_XDMAC_CDS_MSP10    ( *( __IO uint32_t * ) 0x400782FCU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 10) */
    #define REG_XDMAC_CSUS10       ( *( __IO uint32_t * ) 0x40078300U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 10) */
    #define REG_XDMAC_CDUS10       ( *( __IO uint32_t * ) 0x40078304U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 10) */
    #define REG_XDMAC_CIE11        ( *( __O uint32_t * ) 0x40078310U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 11) */
    #define REG_XDMAC_CID11        ( *( __O uint32_t * ) 0x40078314U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 11) */
    #define REG_XDMAC_CIM11        ( *( __O uint32_t * ) 0x40078318U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 11) */
    #define REG_XDMAC_CIS11        ( *( __I uint32_t * ) 0x4007831CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 11) */
    #define REG_XDMAC_CSA11        ( *( __IO uint32_t * ) 0x40078320U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 11) */
    #define REG_XDMAC_CDA11        ( *( __IO uint32_t * ) 0x40078324U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 11) */
    #define REG_XDMAC_CNDA11       ( *( __IO uint32_t * ) 0x40078328U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 11) */
    #define REG_XDMAC_CNDC11       ( *( __IO uint32_t * ) 0x4007832CU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 11) */
    #define REG_XDMAC_CUBC11       ( *( __IO uint32_t * ) 0x40078330U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 11) */
    #define REG_XDMAC_CBC11        ( *( __IO uint32_t * ) 0x40078334U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 11) */
    #define REG_XDMAC_CC11         ( *( __IO uint32_t * ) 0x40078338U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 11) */
    #define REG_XDMAC_CDS_MSP11    ( *( __IO uint32_t * ) 0x4007833CU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 11) */
    #define REG_XDMAC_CSUS11       ( *( __IO uint32_t * ) 0x40078340U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 11) */
    #define REG_XDMAC_CDUS11       ( *( __IO uint32_t * ) 0x40078344U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 11) */
    #define REG_XDMAC_CIE12        ( *( __O uint32_t * ) 0x40078350U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 12) */
    #define REG_XDMAC_CID12        ( *( __O uint32_t * ) 0x40078354U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 12) */
    #define REG_XDMAC_CIM12        ( *( __O uint32_t * ) 0x40078358U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 12) */
    #define REG_XDMAC_CIS12        ( *( __I uint32_t * ) 0x4007835CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 12) */
    #define REG_XDMAC_CSA12        ( *( __IO uint32_t * ) 0x40078360U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 12) */
    #define REG_XDMAC_CDA12        ( *( __IO uint32_t * ) 0x40078364U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 12) */
    #define REG_XDMAC_CNDA12       ( *( __IO uint32_t * ) 0x40078368U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 12) */
    #define REG_XDMAC_CNDC12       ( *( __IO uint32_t * ) 0x4007836CU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 12) */
    #define REG_XDMAC_CUBC12       ( *( __IO uint32_t * ) 0x40078370U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 12) */
    #define REG_XDMAC_CBC12        ( *( __IO uint32_t * ) 0x40078374U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 12) */
    #define REG_XDMAC_CC12         ( *( __IO uint32_t * ) 0x40078378U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 12) */
    #define REG_XDMAC_CDS_MSP12    ( *( __IO uint32_t * ) 0x4007837CU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 12) */
    #define REG_XDMAC_CSUS12       ( *( __IO uint32_t * ) 0x40078380U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 12) */
    #define REG_XDMAC_CDUS12       ( *( __IO uint32_t * ) 0x40078384U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 12) */
    #define REG_XDMAC_CIE13        ( *( __O uint32_t * ) 0x40078390U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 13) */
    #define REG_XDMAC_CID13        ( *( __O uint32_t * ) 0x40078394U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 13) */
    #define REG_XDMAC_CIM13        ( *( __O uint32_t * ) 0x40078398U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 13) */
    #define REG_XDMAC_CIS13        ( *( __I uint32_t * ) 0x4007839CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 13) */
    #define REG_XDMAC_CSA13        ( *( __IO uint32_t * ) 0x400783A0U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 13) */
    #define REG_XDMAC_CDA13        ( *( __IO uint32_t * ) 0x400783A4U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 13) */
    #define REG_XDMAC_CNDA13       ( *( __IO uint32_t * ) 0x400783A8U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 13) */
    #define REG_XDMAC_CNDC13       ( *( __IO uint32_t * ) 0x400783ACU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 13) */
    #define REG_XDMAC_CUBC13       ( *( __IO uint32_t * ) 0x400783B0U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 13) */
    #define REG_XDMAC_CBC13        ( *( __IO uint32_t * ) 0x400783B4U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 13) */
    #define REG_XDMAC_CC13         ( *( __IO uint32_t * ) 0x400783B8U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 13) */
    #define REG_XDMAC_CDS_MSP13    ( *( __IO uint32_t * ) 0x400783BCU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 13) */
    #define REG_XDMAC_CSUS13       ( *( __IO uint32_t * ) 0x400783C0U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 13) */
    #define REG_XDMAC_CDUS13       ( *( __IO uint32_t * ) 0x400783C4U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 13) */
    #define REG_XDMAC_CIE14        ( *( __O uint32_t * ) 0x400783D0U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 14) */
    #define REG_XDMAC_CID14        ( *( __O uint32_t * ) 0x400783D4U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 14) */
    #define REG_XDMAC_CIM14        ( *( __O uint32_t * ) 0x400783D8U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 14) */
    #define REG_XDMAC_CIS14        ( *( __I uint32_t * ) 0x400783DCU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 14) */
    #define REG_XDMAC_CSA14        ( *( __IO uint32_t * ) 0x400783E0U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 14) */
    #define REG_XDMAC_CDA14        ( *( __IO uint32_t * ) 0x400783E4U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 14) */
    #define REG_XDMAC_CNDA14       ( *( __IO uint32_t * ) 0x400783E8U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 14) */
    #define REG_XDMAC_CNDC14       ( *( __IO uint32_t * ) 0x400783ECU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 14) */
    #define REG_XDMAC_CUBC14       ( *( __IO uint32_t * ) 0x400783F0U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 14) */
    #define REG_XDMAC_CBC14        ( *( __IO uint32_t * ) 0x400783F4U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 14) */
    #define REG_XDMAC_CC14         ( *( __IO uint32_t * ) 0x400783F8U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 14) */
    #define REG_XDMAC_CDS_MSP14    ( *( __IO uint32_t * ) 0x400783FCU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 14) */
    #define REG_XDMAC_CSUS14       ( *( __IO uint32_t * ) 0x40078400U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 14) */
    #define REG_XDMAC_CDUS14       ( *( __IO uint32_t * ) 0x40078404U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 14) */
    #define REG_XDMAC_CIE15        ( *( __O uint32_t * ) 0x40078410U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 15) */
    #define REG_XDMAC_CID15        ( *( __O uint32_t * ) 0x40078414U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 15) */
    #define REG_XDMAC_CIM15        ( *( __O uint32_t * ) 0x40078418U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 15) */
    #define REG_XDMAC_CIS15        ( *( __I uint32_t * ) 0x4007841CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 15) */
    #define REG_XDMAC_CSA15        ( *( __IO uint32_t * ) 0x40078420U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 15) */
    #define REG_XDMAC_CDA15        ( *( __IO uint32_t * ) 0x40078424U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 15) */
    #define REG_XDMAC_CNDA15       ( *( __IO uint32_t * ) 0x40078428U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 15) */
    #define REG_XDMAC_CNDC15       ( *( __IO uint32_t * ) 0x4007842CU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 15) */
    #define REG_XDMAC_CUBC15       ( *( __IO uint32_t * ) 0x40078430U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 15) */
    #define REG_XDMAC_CBC15        ( *( __IO uint32_t * ) 0x40078434U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 15) */
    #define REG_XDMAC_CC15         ( *( __IO uint32_t * ) 0x40078438U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 15) */
    #define REG_XDMAC_CDS_MSP15    ( *( __IO uint32_t * ) 0x4007843CU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 15) */
    #define REG_XDMAC_CSUS15       ( *( __IO uint32_t * ) 0x40078440U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 15) */
    #define REG_XDMAC_CDUS15       ( *( __IO uint32_t * ) 0x40078444U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 15) */
    #define REG_XDMAC_CIE16        ( *( __O uint32_t * ) 0x40078450U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 16) */
    #define REG_XDMAC_CID16        ( *( __O uint32_t * ) 0x40078454U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 16) */
    #define REG_XDMAC_CIM16        ( *( __O uint32_t * ) 0x40078458U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 16) */
    #define REG_XDMAC_CIS16        ( *( __I uint32_t * ) 0x4007845CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 16) */
    #define REG_XDMAC_CSA16        ( *( __IO uint32_t * ) 0x40078460U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 16) */
    #define REG_XDMAC_CDA16        ( *( __IO uint32_t * ) 0x40078464U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 16) */
    #define REG_XDMAC_CNDA16       ( *( __IO uint32_t * ) 0x40078468U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 16) */
    #define REG_XDMAC_CNDC16       ( *( __IO uint32_t * ) 0x4007846CU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 16) */
    #define REG_XDMAC_CUBC16       ( *( __IO uint32_t * ) 0x40078470U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 16) */
    #define REG_XDMAC_CBC16        ( *( __IO uint32_t * ) 0x40078474U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 16) */
    #define REG_XDMAC_CC16         ( *( __IO uint32_t * ) 0x40078478U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 16) */
    #define REG_XDMAC_CDS_MSP16    ( *( __IO uint32_t * ) 0x4007847CU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 16) */
    #define REG_XDMAC_CSUS16       ( *( __IO uint32_t * ) 0x40078480U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 16) */
    #define REG_XDMAC_CDUS16       ( *( __IO uint32_t * ) 0x40078484U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 16) */
    #define REG_XDMAC_CIE17        ( *( __O uint32_t * ) 0x40078490U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 17) */
    #define REG_XDMAC_CID17        ( *( __O uint32_t * ) 0x40078494U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 17) */
    #define REG_XDMAC_CIM17        ( *( __O uint32_t * ) 0x40078498U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 17) */
    #define REG_XDMAC_CIS17        ( *( __I uint32_t * ) 0x4007849CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 17) */
    #define REG_XDMAC_CSA17        ( *( __IO uint32_t * ) 0x400784A0U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 17) */
    #define REG_XDMAC_CDA17        ( *( __IO uint32_t * ) 0x400784A4U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 17) */
    #define REG_XDMAC_CNDA17       ( *( __IO uint32_t * ) 0x400784A8U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 17) */
    #define REG_XDMAC_CNDC17       ( *( __IO uint32_t * ) 0x400784ACU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 17) */
    #define REG_XDMAC_CUBC17       ( *( __IO uint32_t * ) 0x400784B0U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 17) */
    #define REG_XDMAC_CBC17        ( *( __IO uint32_t * ) 0x400784B4U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 17) */
    #define REG_XDMAC_CC17         ( *( __IO uint32_t * ) 0x400784B8U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 17) */
    #define REG_XDMAC_CDS_MSP17    ( *( __IO uint32_t * ) 0x400784BCU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 17) */
    #define REG_XDMAC_CSUS17       ( *( __IO uint32_t * ) 0x400784C0U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 17) */
    #define REG_XDMAC_CDUS17       ( *( __IO uint32_t * ) 0x400784C4U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 17) */
    #define REG_XDMAC_CIE18        ( *( __O uint32_t * ) 0x400784D0U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 18) */
    #define REG_XDMAC_CID18        ( *( __O uint32_t * ) 0x400784D4U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 18) */
    #define REG_XDMAC_CIM18        ( *( __O uint32_t * ) 0x400784D8U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 18) */
    #define REG_XDMAC_CIS18        ( *( __I uint32_t * ) 0x400784DCU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 18) */
    #define REG_XDMAC_CSA18        ( *( __IO uint32_t * ) 0x400784E0U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 18) */
    #define REG_XDMAC_CDA18        ( *( __IO uint32_t * ) 0x400784E4U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 18) */
    #define REG_XDMAC_CNDA18       ( *( __IO uint32_t * ) 0x400784E8U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 18) */
    #define REG_XDMAC_CNDC18       ( *( __IO uint32_t * ) 0x400784ECU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 18) */
    #define REG_XDMAC_CUBC18       ( *( __IO uint32_t * ) 0x400784F0U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 18) */
    #define REG_XDMAC_CBC18        ( *( __IO uint32_t * ) 0x400784F4U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 18) */
    #define REG_XDMAC_CC18         ( *( __IO uint32_t * ) 0x400784F8U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 18) */
    #define REG_XDMAC_CDS_MSP18    ( *( __IO uint32_t * ) 0x400784FCU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 18) */
    #define REG_XDMAC_CSUS18       ( *( __IO uint32_t * ) 0x40078500U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 18) */
    #define REG_XDMAC_CDUS18       ( *( __IO uint32_t * ) 0x40078504U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 18) */
    #define REG_XDMAC_CIE19        ( *( __O uint32_t * ) 0x40078510U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 19) */
    #define REG_XDMAC_CID19        ( *( __O uint32_t * ) 0x40078514U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 19) */
    #define REG_XDMAC_CIM19        ( *( __O uint32_t * ) 0x40078518U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 19) */
    #define REG_XDMAC_CIS19        ( *( __I uint32_t * ) 0x4007851CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 19) */
    #define REG_XDMAC_CSA19        ( *( __IO uint32_t * ) 0x40078520U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 19) */
    #define REG_XDMAC_CDA19        ( *( __IO uint32_t * ) 0x40078524U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 19) */
    #define REG_XDMAC_CNDA19       ( *( __IO uint32_t * ) 0x40078528U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 19) */
    #define REG_XDMAC_CNDC19       ( *( __IO uint32_t * ) 0x4007852CU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 19) */
    #define REG_XDMAC_CUBC19       ( *( __IO uint32_t * ) 0x40078530U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 19) */
    #define REG_XDMAC_CBC19        ( *( __IO uint32_t * ) 0x40078534U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 19) */
    #define REG_XDMAC_CC19         ( *( __IO uint32_t * ) 0x40078538U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 19) */
    #define REG_XDMAC_CDS_MSP19    ( *( __IO uint32_t * ) 0x4007853CU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 19) */
    #define REG_XDMAC_CSUS19       ( *( __IO uint32_t * ) 0x40078540U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 19) */
    #define REG_XDMAC_CDUS19       ( *( __IO uint32_t * ) 0x40078544U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 19) */
    #define REG_XDMAC_CIE20        ( *( __O uint32_t * ) 0x40078550U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 20) */
    #define REG_XDMAC_CID20        ( *( __O uint32_t * ) 0x40078554U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 20) */
    #define REG_XDMAC_CIM20        ( *( __O uint32_t * ) 0x40078558U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 20) */
    #define REG_XDMAC_CIS20        ( *( __I uint32_t * ) 0x4007855CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 20) */
    #define REG_XDMAC_CSA20        ( *( __IO uint32_t * ) 0x40078560U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 20) */
    #define REG_XDMAC_CDA20        ( *( __IO uint32_t * ) 0x40078564U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 20) */
    #define REG_XDMAC_CNDA20       ( *( __IO uint32_t * ) 0x40078568U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 20) */
    #define REG_XDMAC_CNDC20       ( *( __IO uint32_t * ) 0x4007856CU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 20) */
    #define REG_XDMAC_CUBC20       ( *( __IO uint32_t * ) 0x40078570U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 20) */
