FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/instance/instance_xdmac.h
    #define REG_XDMAC_CBC20        ( *( __IO uint32_t * ) 0x40078574U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 20) */
    #define REG_XDMAC_CC20         ( *( __IO uint32_t * ) 0x40078578U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 20) */
    #define REG_XDMAC_CDS_MSP20    ( *( __IO uint32_t * ) 0x4007857CU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 20) */
    #define REG_XDMAC_CSUS20       ( *( __IO uint32_t * ) 0x40078580U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 20) */
    #define REG_XDMAC_CDUS20       ( *( __IO uint32_t * ) 0x40078584U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 20) */
    #define REG_XDMAC_CIE21        ( *( __O uint32_t * ) 0x40078590U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 21) */
    #define REG_XDMAC_CID21        ( *( __O uint32_t * ) 0x40078594U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 21) */
    #define REG_XDMAC_CIM21        ( *( __O uint32_t * ) 0x40078598U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 21) */
    #define REG_XDMAC_CIS21        ( *( __I uint32_t * ) 0x4007859CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 21) */
    #define REG_XDMAC_CSA21        ( *( __IO uint32_t * ) 0x400785A0U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 21) */
    #define REG_XDMAC_CDA21        ( *( __IO uint32_t * ) 0x400785A4U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 21) */
    #define REG_XDMAC_CNDA21       ( *( __IO uint32_t * ) 0x400785A8U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 21) */
    #define REG_XDMAC_CNDC21       ( *( __IO uint32_t * ) 0x400785ACU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 21) */
    #define REG_XDMAC_CUBC21       ( *( __IO uint32_t * ) 0x400785B0U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 21) */
    #define REG_XDMAC_CBC21        ( *( __IO uint32_t * ) 0x400785B4U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 21) */
    #define REG_XDMAC_CC21         ( *( __IO uint32_t * ) 0x400785B8U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 21) */
    #define REG_XDMAC_CDS_MSP21    ( *( __IO uint32_t * ) 0x400785BCU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 21) */
    #define REG_XDMAC_CSUS21       ( *( __IO uint32_t * ) 0x400785C0U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 21) */
    #define REG_XDMAC_CDUS21       ( *( __IO uint32_t * ) 0x400785C4U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 21) */
    #define REG_XDMAC_CIE22        ( *( __O uint32_t * ) 0x400785D0U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 22) */
    #define REG_XDMAC_CID22        ( *( __O uint32_t * ) 0x400785D4U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 22) */
    #define REG_XDMAC_CIM22        ( *( __O uint32_t * ) 0x400785D8U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 22) */
    #define REG_XDMAC_CIS22        ( *( __I uint32_t * ) 0x400785DCU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 22) */
    #define REG_XDMAC_CSA22        ( *( __IO uint32_t * ) 0x400785E0U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 22) */
    #define REG_XDMAC_CDA22        ( *( __IO uint32_t * ) 0x400785E4U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 22) */
    #define REG_XDMAC_CNDA22       ( *( __IO uint32_t * ) 0x400785E8U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 22) */
    #define REG_XDMAC_CNDC22       ( *( __IO uint32_t * ) 0x400785ECU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 22) */
    #define REG_XDMAC_CUBC22       ( *( __IO uint32_t * ) 0x400785F0U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 22) */
    #define REG_XDMAC_CBC22        ( *( __IO uint32_t * ) 0x400785F4U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 22) */
    #define REG_XDMAC_CC22         ( *( __IO uint32_t * ) 0x400785F8U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 22) */
    #define REG_XDMAC_CDS_MSP22    ( *( __IO uint32_t * ) 0x400785FCU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 22) */
    #define REG_XDMAC_CSUS22       ( *( __IO uint32_t * ) 0x40078600U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 22) */
    #define REG_XDMAC_CDUS22       ( *( __IO uint32_t * ) 0x40078604U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 22) */
    #define REG_XDMAC_CIE23        ( *( __O uint32_t * ) 0x40078610U )  /**< \brief (XDMAC) Channel Interrupt Enable Register (chid = 23) */
    #define REG_XDMAC_CID23        ( *( __O uint32_t * ) 0x40078614U )  /**< \brief (XDMAC) Channel Interrupt Disable Register (chid = 23) */
    #define REG_XDMAC_CIM23        ( *( __O uint32_t * ) 0x40078618U )  /**< \brief (XDMAC) Channel Interrupt Mask Register (chid = 23) */
    #define REG_XDMAC_CIS23        ( *( __I uint32_t * ) 0x4007861CU )  /**< \brief (XDMAC) Channel Interrupt Status Register (chid = 23) */
    #define REG_XDMAC_CSA23        ( *( __IO uint32_t * ) 0x40078620U ) /**< \brief (XDMAC) Channel Source Address Register (chid = 23) */
    #define REG_XDMAC_CDA23        ( *( __IO uint32_t * ) 0x40078624U ) /**< \brief (XDMAC) Channel Destination Address Register (chid = 23) */
    #define REG_XDMAC_CNDA23       ( *( __IO uint32_t * ) 0x40078628U ) /**< \brief (XDMAC) Channel Next Descriptor Address Register (chid = 23) */
    #define REG_XDMAC_CNDC23       ( *( __IO uint32_t * ) 0x4007862CU ) /**< \brief (XDMAC) Channel Next Descriptor Control Register (chid = 23) */
    #define REG_XDMAC_CUBC23       ( *( __IO uint32_t * ) 0x40078630U ) /**< \brief (XDMAC) Channel Microblock Control Register (chid = 23) */
    #define REG_XDMAC_CBC23        ( *( __IO uint32_t * ) 0x40078634U ) /**< \brief (XDMAC) Channel Block Control Register (chid = 23) */
    #define REG_XDMAC_CC23         ( *( __IO uint32_t * ) 0x40078638U ) /**< \brief (XDMAC) Channel Configuration Register (chid = 23) */
    #define REG_XDMAC_CDS_MSP23    ( *( __IO uint32_t * ) 0x4007863CU ) /**< \brief (XDMAC) Channel Data Stride Memory Set Pattern (chid = 23) */
    #define REG_XDMAC_CSUS23       ( *( __IO uint32_t * ) 0x40078640U ) /**< \brief (XDMAC) Channel Source Microblock Stride (chid = 23) */
    #define REG_XDMAC_CDUS23       ( *( __IO uint32_t * ) 0x40078644U ) /**< \brief (XDMAC) Channel Destination Microblock Stride (chid = 23) */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#endif /* _SAMV71_XDMAC_INSTANCE_ */
